_sdaiGetAttributeType(Sdai_instS*)
\details
Retrieves the specified attribute's type.
\param attribute [in] An attribute instance.
\returns An attribute type.
\remarks
The functions starting from _sdai are ODA extensions over the standard.
Possible error codes:
* sdaiEI_NVLD - Entity instance invalid.
* sdaiAT_NDEF - Attribute not defined.
\code
SdaiEntity ifcPostalAddress = sdaiGetEntity(pModel, "ifcpostaladdress");
auto purposeAttr = sdaiGetAttrDefinition(ifcPostalAddress, "purpose");
SdaiAttributeType attrType = _sdaiGetAttributeType(purposeAttr);